In [1]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline


df = pd.read_csv('../data/cb_people.csv')

In [2]:
df.head().T

                          0         1        2      3             4
id                        1         2        3      4             5
object_id               p:2       p:3      p:4    p:5           p:6
first_name              Ben     Kevin     Raju    Ian         Kevin
last_name           Elowitz  Flaherty  Vegesna  Wenig          Rose
birthplace              NaN       NaN      NaN    NaN   Redding, CA
affiliation_name  Blue Nile  Wetpaint     Zoho   Zoho  i/o Ventures

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 226709 entries, 0 to 226708
Data columns (total 6 columns):
id                  226709 non-null int64
object_id           226709 non-null object
first_name          226704 non-null object
last_name           226708 non-null object
birthplace          28084 non-null object
affiliation_name    226689 non-null object
dtypes: int64(1), object(5)
memory usage: 10.4+ MB

In [4]:
list(df.columns)

['id',
 'object_id',
 'first_name',
 'last_name',
 'birthplace',
 'affiliation_name']

In [5]:
removed = [
 'entity_type',
 'entity_id',
 'parent_id',
 'name',
 
 'permalink',



 'closed_at',

 'homepage_url',
 'twitter_username',
 'logo_url',
 'logo_width',
 'logo_height',
 'short_description',
 'description',
 

 

 'first_investment_at',
 'last_investment_at',
 'investment_rounds',
 'invested_companies',
 'first_funding_at',
 'last_funding_at',
 'funding_rounds',
 'funding_total_usd',
 'first_milestone_at',
 'last_milestone_at',
 'milestones',
 'relationships',
 'created_by',
 'created_at',
 'updated_at']
keep = [x for x in list(df.columns) if x not in removed]
df = df[keep]
df.head().T

                          0         1        2      3             4
id                        1         2        3      4             5
object_id               p:2       p:3      p:4    p:5           p:6
first_name              Ben     Kevin     Raju    Ian         Kevin
last_name           Elowitz  Flaherty  Vegesna  Wenig          Rose
birthplace              NaN       NaN      NaN    NaN   Redding, CA
affiliation_name  Blue Nile  Wetpaint     Zoho   Zoho  i/o Ventures